In [4]:
import pandas as pd

In [5]:
import pandas as pd
import numpy as np

To store and 1d in pandas

In [6]:
list1 = ["A","B","C","D","E"]
series1= pd.Series(list1)

In [7]:
series1

0    A
1    B
2    C
3    D
4    E
dtype: object

In [8]:
list1 = ["A","B","C","D","E"]
series1= pd.Series(list1)

In [9]:
array1 = np.random.randint(20,25, size=(10))
array1

array([20, 20, 22, 21, 24, 24, 24, 24, 20, 20], dtype=int32)

In [10]:
series2 = pd.Series(array1)

In [11]:
series2

0    20
1    20
2    22
3    21
4    24
5    24
6    24
7    24
8    20
9    20
dtype: int32

In [12]:
series3 = pd.Series(np.random.randint(20,25, size=(10)))
series3

0    23
1    21
2    24
3    21
4    24
5    21
6    20
7    20
8    21
9    23
dtype: int32

In [13]:
series2+series3

0    43
1    41
2    46
3    42
4    48
5    45
6    44
7    44
8    41
9    43
dtype: int32

In [14]:
series2*series3

0    460
1    420
2    528
3    441
4    576
5    504
6    480
7    480
8    420
9    460
dtype: int32

In [15]:
series2/series3

0    0.869565
1    0.952381
2    0.916667
3    1.000000
4    1.000000
5    1.142857
6    1.200000
7    1.200000
8    0.952381
9    0.869565
dtype: float64

# data frame

In [16]:
students = ["student1","student2","student3","student4","student5"]
rollno = ['1','2','3','4','5']
scores = [45,67,78,89,45]

In [17]:
record = {
    "student":students,
    "rollno":rollno,
    "scores":scores
    }

In [18]:
record

{'student': ['student1', 'student2', 'student3', 'student4', 'student5'],
 'rollno': ['1', '2', '3', '4', '5'],
 'scores': [45, 67, 78, 89, 45]}

In [19]:
record_df = pd.DataFrame(record)
record_df

    student rollno  scores
0  student1      1      45
1  student2      2      67
2  student3      3      78
3  student4      4      89
4  student5      5      45

In [20]:
record_df.set_index(["rollno"]) # index

         student  scores
rollno
1       student1      45
2       student2      67
3       student3      78
4       student4      89
5       student5      45

In [21]:
dict1 = {
    "A":[12,13,14,15,16],
    "B":[13,14,15,16,17],
    "C":[14,15,16,17,18],
    "D":[15,16,17,18,19]
}

In [22]:
df_1 = pd.DataFrame(dict1)

In [23]:
df_1

    A   B   C   D
0  12  13  14  15
1  13  14  15  16
2  14  15  16  17
3  15  16  17  18
4  16  17  18  19

to see columns in df_1

In [24]:
df_1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### Accessing the desired columns features

In [25]:
df_1["A"]

0    12
1    13
2    14
3    15
4    16
Name: A, dtype: int64

In [26]:
df_1[["A","B"]]

    A   B
0  12  13
1  13  14
2  14  15
3  15  16
4  16  17

In [27]:
df_1["E"] =  df_1["A"]+df_1["B"]+df_1["C"]+df_1["D"]

In [28]:
df_1

    A   B   C   D   E
0  12  13  14  15  54
1  13  14  15  16  58
2  14  15  16  17  62
3  15  16  17  18  66
4  16  17  18  19  70

In [29]:
df_1["F"] = df_1["E"]/4
df_1

    A   B   C   D   E     F
0  12  13  14  15  54  13.5
1  13  14  15  16  58  14.5
2  14  15  16  17  62  15.5
3  15  16  17  18  66  16.5
4  16  17  18  19  70  17.5

info() method

In [30]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 372.0 bytes

In [31]:
dict2={
    "students":["student1","student2","student3","student4","student5","student6","student7"],
    "rollno":['005','006',np.nan,'005','011','012','013'],
    "gender":["MALE",np.nan,"FEMALE","FEMALE","male","female","female"],
    "MARK_OBTAINED":[65,66,34,56,20,np.nan,56]

}

In [32]:
dict2

{'students': ['student1',
  'student2',
  'student3',
  'student4',
  'student5',
  'student6',
  'student7'],
 'rollno': ['005', '006', nan, '005', '011', '012', '013'],
 'gender': ['MALE', nan, 'FEMALE', 'FEMALE', 'male', 'female', 'female'],
 'MARK_OBTAINED': [65, 66, 34, 56, 20, nan, 56]}

In [33]:
student_df = pd.DataFrame(dict2)

In [34]:
student_df

   students rollno  gender  MARK_OBTAINED
0  student1    005    MALE           65.0
1  student2    006     NaN           66.0
2  student3    NaN  FEMALE           34.0
3  student4    005  FEMALE           56.0
4  student5    011    male           20.0
5  student6    012  female            NaN
6  student7    013  female           56.0

### To check  the null value

In [35]:
student_df.isnull()

   students  rollno  gender  MARK_OBTAINED
0     False   False   False          False
1     False   False    True          False
2     False    True   False          False
3     False   False   False          False
4     False   False   False          False
5     False   False   False           True
6     False   False   False          False

In [36]:
student_df.isnull().sum()

students         0
rollno           1
gender           1
MARK_OBTAINED    1
dtype: int64

In [37]:
student_df.duplicated().sum()

np.int64(0)

## Remove the dupicate value

In [38]:
student_df.drop_duplicates()

   students rollno  gender  MARK_OBTAINED
0  student1    005    MALE           65.0
1  student2    006     NaN           66.0
2  student3    NaN  FEMALE           34.0
3  student4    005  FEMALE           56.0
4  student5    011    male           20.0
5  student6    012  female            NaN
6  student7    013  female           56.0

In [39]:
student_df.dropna()

   students rollno  gender  MARK_OBTAINED
0  student1    005    MALE           65.0
3  student4    005  FEMALE           56.0
4  student5    011    male           20.0
6  student7    013  female           56.0

In [40]:
gender_mode = student_df['gender'].mode()[0]

gender_mode

'FEMALE'

In [44]:
marks_mean = student_df['MARK_OBTAINED'].mean()
marks_mean

np.float64(49.5)

In [45]:
student_df['gender']=student_df['gender'].fillna(gender_mode)
student_df

   students rollno  gender  MARK_OBTAINED
0  student1    005    MALE           65.0
1  student2    006  FEMALE           66.0
2  student3    NaN  FEMALE           34.0
3  student4    005  FEMALE           56.0
4  student5    011    male           20.0
5  student6    012  female            NaN
6  student7    013  female           56.0

In [46]:
student_df['MARK_OBTAINED']=student_df['MARK_OBTAINED'].fillna(marks_mean)

In [47]:
student_df

   students rollno  gender  MARK_OBTAINED
0  student1    005    MALE           65.0
1  student2    006  FEMALE           66.0
2  student3    NaN  FEMALE           34.0
3  student4    005  FEMALE           56.0
4  student5    011    male           20.0
5  student6    012  female           49.5
6  student7    013  female           56.0